Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ451/svd/WBZ451.svd
            <register>
               <name>ADCCON2</name>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCDIV</name>
                     <description>Shared ADC Clock Divider bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ADCEIS</name>
                     <description>Shared ADC Early Interrupt Select bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ADCEISSelect</name>
                        <enumeratedValue>
                           <name>8CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 8 ADC clocks prior to end of conversion</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 7 ADC clocks prior to end of conversion</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 6 ADC clocks prior to end of conversion</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 5 ADC clocks prior to end of conversion</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 4 ADC clocks prior to end of conversion</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 3 ADC clocks prior to end of conversion</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 2 ADC module clocks prior to end of conversion</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 1 ADC module clock prior to end of conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENXCNVRT</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSIEN</name>
                     <description>End of Scan Interrupt Enable bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EOSIENSelect</name>
                        <enumeratedValue>
                           <name>EOSRDY_INT</name>
                           <description>Interrupt will be generated when EOSRDY bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOEOSRDY_INT</name>
                           <description>No interrupt is generated when the EOSRDY bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFFLTIEN</name>
                     <description>Band Gap/ Vref Voltage Fault Interrupt Enable bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>REFFLTIENSelect</name>
                        <enumeratedValue>
                           <name>REFFLT_INT</name>
                           <description>Interrupt will be generated when the REFFLT bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOREFFLT_INT</name>
                           <description>No interrupt is generated when the REFFLT bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BGVRIEN</name>
                     <description>Band Gap/ Vref Voltage Ready Interrupt Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BGVRIENSelect</name>
                        <enumeratedValue>
                           <name>BGVRDDY_INT</name>
                           <description>Interrupt will be generated when the BGVRDDY bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOBGVRDDY_INT</name>
                           <description>No interrupt is generated when the BGVRRDY bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMC</name>
                     <description>Sample Time for the Shared ADC (ADC7) bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>EOSRDY</name>
                     <description>End of Scan Interrupt Status bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EOSRDYSelect</name>
                        <enumeratedValue>
                           <name>SCAN_COMPLETE</name>
                           <description>All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_NOT_COMPLETE</name>
                           <description>Scanning has not completed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFFLT</name>
                     <description>Band Gap/ Vref / AVdd BOR Fault Status bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>REFFLTSelect</name>
                        <enumeratedValue>
                           <name>BG_VREF_FLT</name>
                           <description>Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BG_VREF_OK</name>
                           <description>Band gap and Vref voltage are working properly</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BGVRRDY</name>
                     <description>Band Gap Voltage/ADC Reference Voltage Status bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BGVRRDYSelect</name>
                        <enumeratedValue>
                           <name>VREF_RDY</name>
                           <description>Both band gap voltage and ADC reference voltages (Vref) are ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VREF_NOTRDY</name>
                           <description>Either or both band gap voltage and ADC reference voltages (Vref) are not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCON3</name>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADINSEL</name>
                     <description>Analog Input Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>ADINSELSelect</name>
                        <enumeratedValue>
                           <name>TMP_SENSE</name>
                           <description>CTMU Temperature Sensor (internal AN11)</description>
                           <value>0x0B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VBATDIV2_SENSE</name>
                           <description>VBAT/2 (internal AN10)</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1P2V_SENSE</name>
                           <description>IVref 1.2V (internal AN9)</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BGREF</name>
                           <description>BandGap Reference (internal AN8)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN7</name>
                           <description>AN7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN6</name>
                           <description>AN6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN5</name>
                           <description>AN5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN4</name>
                           <description>AN4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN3</name>
                           <description>AN3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN2</name>
                           <description>AN2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN1</name>
                           <description>AN1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN0</name>
                           <description>AN0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GSWTRG</name>
                     <description>Global Software Trigger bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GSWTRGSelect</name>
                        <enumeratedValue>
                           <name>GSWTRG</name>
                           <description>Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_GSWTRG</name>
                           <description>Do not trigger an analog-to-digital conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLSWTRG</name>
                     <description>Global Level Software Trigger bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GLSWTRGSelect</name>
                        <enumeratedValue>
                           <name>GLSWTRG</name>
                           <description>Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_GLSWTRG</name>
                           <description>Do not trigger an analog-to-digital conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RQCNVRT</name>
                     <description>Individual ADC Input Conversion Request bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RQCNVRTSelect</name>
                        <enumeratedValue>
                           <name>IND_TRIGGER</name>
                           <description>Trigger the conversion of the selected ADC input as specified by the ADINSEL bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_TRIGGER</name>
                           <description>Do not trigger the conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMP</name>
                     <description>Shared ADC7 Analog Input Sampling Enable bit </description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SAMPSelect</name>
                        <enumeratedValue>
                           <name>SAMPLE</name>
                           <description>The ADC S&amp;H amplifier is sampling</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOLD</name>
                           <description>The ADC S&amp;H amplifier is holding</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDRDY</name>
                     <description>ADC Update Ready Status bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UPDRDYSelect</name>
                        <enumeratedValue>
                           <name>UPDATE_RDY</name>
                           <description>ADC SFRs can be updated</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_NOT_RDY</name>
                           <description>ADC SFRs cannot be updated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDIEN</name>
                     <description>Update Ready Interrupt Enable bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UPDIENSelect</name>
                        <enumeratedValue>
                           <name>INT_ON_UPDATE_RDY</name>
                           <description>Interrupt will be generated when the UPDRDY bit is set by hardware</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_INT_ON_UPDATE_RDY</name>
                           <description>No interrupt is generated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSUSP</name>
                     <description>Trigger Suspend bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRGSUSPSelect</name>
                        <enumeratedValue>
                           <name>TRIG_BLOCKED</name>
                           <description>Triggers are blocked from starting a new analog-to-digital conversion</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIG_NOT_BLOCKED</name>
                           <description>Triggers are not blocked</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFSEL</name>
                     <description>Voltage Reference Input Selection bits</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>VREFSELSelect</name>
                        <enumeratedValue>
                           <name>AVDD_AVSS</name>
                           <description>ADC VREFH is AVDD, ADC VREFL is AVSS</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIGEN7</name>
                     <description>Shared ADC (ADC7) Digital Enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONCLKDIV</name>
                     <description>Analog-to-Digital Control Clock Divider bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>ADCSEL</name>
                     <description>Analog-to-Digital Clock Source bits</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ADCSELSelect</name>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>SYSCLK</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFCLK3</name>
                           <description>REFCLK3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBCLK1</name>
                           <description>PBCLK1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
