Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ451/svd/WBZ451.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RCON</name>
         <version>031001.0</version>
         <baseAddress>0x44000a00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x60</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCON</name>
               <description>RESET CONTROL REGISTER</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power-On Reset Flag bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORSelect</name>
                        <enumeratedValue>
                           <name>POR</name>
                           <description>A Power-up Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_POR</name>
                           <description>A Power-up Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOR</name>
                     <description>Brown-out Reset Flag bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BORSelect</name>
                        <enumeratedValue>
                           <name>BOR</name>
                           <description>A Brown-out Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_BOR</name>
                           <description>A Brown-out Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>Wake from Idle Flag bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IDLESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Device was in Idle mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_IDLE</name>
                           <description>Device was not in Idle mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <description>Wake from Sleep Flag bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPSelect</name>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>Device has been in Sleep mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_SLEEP</name>
                           <description>Device has not been in Sleep mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTO</name>
                     <description>Watchdog Timer Time-Out Flag bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WDTOSelect</name>
                        <enumeratedValue>
                           <name>WDTO</name>
                           <description>WDT Time-out has occurred and caused a reset.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_WDTO</name>
                           <description>WDT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMTO</name>
                     <description>Deadman Timer Time-Out Flag bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DMTOSelect</name>
                        <enumeratedValue>
                           <name>DMTO</name>
                           <description>DMT Time-out has occurred and caused a reset.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_DMTO</name>
                           <description>DMT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWR</name>
                     <description>Software Reset Flag bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSelect</name>
                        <enumeratedValue>
                           <name>SWR</name>
                           <description>A Software Commanded Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_SWR</name>
                           <description>A Software Commanded Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTR</name>
                     <description>External Reset (MCLR) Status bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EXTRSelect</name>
                        <enumeratedValue>
                           <name>EXTR</name>
                           <description>A Master Clear (pin) Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_EXTR</name>
                           <description>A Master Clear (pin) Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMR</name>
                     <description>Configuration Mismatch Flag bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMRSelect</name>
                        <enumeratedValue>
                           <name>CMR</name>
                           <description>A Configuration Mismatch Reset Event has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_CMR</name>
                           <description>A Configuration Mismatch Reset Event has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPSLP</name>
                     <description>DPSLP Deep Sleep Mode Flag Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DPSLPSelect</name>
                        <enumeratedValue>
                           <name>DSLP</name>
                           <description>Deep Sleep Mode has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_DSLP</name>
                           <description>Deep Sleep Mode has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMEOL</name>
                     <description>NVM End of Life Flag Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NVMEOLSelect</name>
                        <enumeratedValue>
                           <name>NO_NVMEOL</name>
                           <description>A NVM EOL Failure has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVMEOL</name>
                           <description>A NVM EOL Failure has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMLTA</name>
                     <description>NVM Life Time Alert Flag Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NVMLTASelect</name>
                        <enumeratedValue>
                           <name>NO_NVMLTA</name>
                           <description>A NVM LTA Error has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVMLTA</name>
                           <description>A NVM LTA Error has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCFGFAIL</name>
                     <description>BCFG Failure Flag Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCFGFAILSelect</name>
                        <enumeratedValue>
                           <name>NO_BCFGFAIL</name>
                           <description>A BCFG Failure has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCFGFAIL</name>
                           <description>A BCFG Failure has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCFGERR</name>
                     <description>BCFG Error Flag Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCFGERRSelect</name>
                        <enumeratedValue>
                           <name>NO_BCFGERR</name>
                           <description>A BCFG Error has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCFGERR</name>
                           <description>A BCFG Error has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORCORE</name>
                     <description>Core Voltage POR Flag bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORCORESelect</name>
                        <enumeratedValue>
                           <name>PORCORE</name>
                           <description>A Power-up Reset has occurred due to Core Voltage.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_PORCORE</name>
                           <description>A Power-up Reset has not occurred due to Core Voltage.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORIO</name>
                     <description>IO Voltage POR Flag bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORIOSelect</name>
                        <enumeratedValue>
                           <name>PORIO</name>
                           <description>A Power-up Reset has occurred due to IO Voltage.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_PORIO</name>
                           <description>A Power-up Reset has not occurred due to IO Voltage.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCONCLR</name>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RCONSET</name>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RCONINV</name>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RSWRST</name>
               <description>SOFTWARE RESET REGISTER</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>SWRST</name>
                           <description>Enable software reset event</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SWRST</name>
                           <description>Do not enable software reset event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSWRSTCLR</name>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RSWRSTSET</name>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RSWRSTINV</name>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
